## Python statistics essential training - 02_03_pandas

Standard imports

In [1]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

In [2]:
planets =pd.read_csv('Planets.csv')

In [3]:
planets.head()

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.330,4879,4222.6,57.9,88,47.4,167,0.00,0,No,Yes,1974-03-29,Mariner 10
1,VENUS,4.870,"12,104",2802.0,108.2,224.7,35.0,464,92.00,0,No,No,1962-08-27,Mariner 2
2,EARTH,5.970,"12,756",24.0,149.6,365.2,29.8,15,1.00,1,No,Yes,NaN,NaN
3,MOON,0.073,3475,708.7,NaN,27.3,1.0,-20,0.00,0,No,No,1959-09-12,Luna 2
4,MARS,0.642,6792,24.7,227.9,687,24.1,-65,0.01,2,No,No,1965-07-15,Mariner 4

In [4]:
#making a subset by choosing usecols with indexes of columns 
planets_subset = pd.read_csv('Planets.csv',usecols=[0,1,2,3])
planets_subset.head()

    Planet   Mass Diameter  DayLength
0  MERCURY  0.330     4879     4222.6
1    VENUS  4.870   12,104     2802.0
2    EARTH  5.970   12,756       24.0
3     MOON  0.073     3475      708.7
4     MARS  0.642     6792       24.7

In [5]:
# selecting a column in a dataframe produces data series 
#planet.mass can also be used 
planets['Mass']

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [7]:
planets.index # produces the index of the dataframe

RangeIndex(start=0, stop=10, step=1)

In [8]:
planets.set_index('Planet',inplace=True) # set index sets the index of the dataframe to the mentioned column 
#Inplace= true make the changes to the original dataframe

In [9]:
planets.head()

,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
Planet,,,,,,,,,,,,,
MERCURY,0.330,4879,4222.6,57.9,88,47.4,167,0.00,0,No,Yes,1974-03-29,Mariner 10
VENUS,4.870,"12,104",2802.0,108.2,224.7,35.0,464,92.00,0,No,No,1962-08-27,Mariner 2
EARTH,5.970,"12,756",24.0,149.6,365.2,29.8,15,1.00,1,No,Yes,NaN,NaN
MOON,0.073,3475,708.7,NaN,27.3,1.0,-20,0.00,0,No,No,1959-09-12,Luna 2
MARS,0.642,6792,24.7,227.9,687,24.1,-65,0.01,2,No,No,1965-07-15,Mariner 4

In [12]:
planets.loc['MERCURY':'EARTH'] # Slicing can be done use loc keyword on the dataframe accessing the index names 
# for Accessing the index columns use keyword Iloc
#

,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
Planet,,,,,,,,,,,,,
MERCURY,0.33,4879,4222.6,57.9,88,47.4,167,0.0,0,No,Yes,1974-03-29,Mariner 10
VENUS,4.87,"12,104",2802.0,108.2,224.7,35.0,464,92.0,0,No,No,1962-08-27,Mariner 2
EARTH,5.97,"12,756",24.0,149.6,365.2,29.8,15,1.0,1,No,Yes,NaN,NaN

In [15]:
planets.FirstVisited['MERCURY']

'1974-03-29'

In [16]:
planets.loc['MERCURY','FirstVisited']

'1974-03-29'

In [17]:
planets.loc['MERCURY'].FirstVisited

'1974-03-29'

In [18]:
planets.FirstVisited=pd.to_datetime(planets.FirstVisited)

In [20]:
#Filtering the datetime column using year 
planets.FirstVisited.dt.year

Planet
MERCURY    1974.0
VENUS      1962.0
EARTH         NaN
MOON       1959.0
MARS       1965.0
JUPITER    1973.0
SATURN     1979.0
URANUS     1986.0
NEPTUNE    1989.0
PLUTO      2015.0
Name: FirstVisited, dtype: float64